Revit 2027 API
PointCollection.GetEnumerator Method
Returns an enumerator that iterates through a collection.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual IEnumerator<CloudPoint> GetEnumerator()
Public Overridable Function GetEnumerator As IEnumerator(Of CloudPoint)
public:
virtual IEnumerator<CloudPoint>^ GetEnumerator()
abstract GetEnumerator : unit -> IEnumerator<CloudPoint>
override GetEnumerator : unit -> IEnumerator<CloudPoint>
Return Value
IEnumerator<CloudPoint>
An IEnumerator object that can be used to iterate through the collection.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
PointCollection Class
Autodesk.Revit.DB.PointClouds Namespace